# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=gateway_api_endpoint]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 0s [id=user_pool_id]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Read complete after 0s [id=customer_api_endpoint]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=45irofnuelporlh6aln8a0equu]
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Read complete after 0s [id=organization_api_endpoint]
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Read complete after 0s [id=identity_api_endpoint]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_zXuO5rSVp6ggZf9TFozQvEnUpO6i]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-staging.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_8TgRRS5KsqASueLNJxDpVewRyk9K]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-staging.connectilly.com",
          - "staging-web-eight.vercel.app",
          - "staging-web-connectilly.vercel.app",
          - "staging-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                        = "3125~7680e399d4f1b25a7933c24c4bfd208ec13a8e6a" -> "4464~fdf4e555498e664dee085d385a47f77efb3011d5"
          ~ "../../../src/pages/api/auth/[...nextauth].ts"                                            = "418~479cc271f035b3e508ac3a8ad4435c9dab491260" -> "531~9f17439a1ba68397e8abb71a2bf89ecf35e0798d"
            # (59 unchanged elements hidden)
        }
      ~ id          = "dpl_8TgRRS5KsqASueLNJxDpVewRyk9K" -> (known after apply)
      ~ url         = "staging-kbfw32tws-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_zXuO5rSVp6ggZf9TFozQvEnUpO6i"
        name                       = "staging-web"
      ~ serverless_function_region = "iad1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*